Tekla Open API Reference for Tekla Structures 2025
Filter Constructor (String, IFormatProvider)
 Initializes a new instance of the Filter class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Filter(
	string FullFileName,
	IFormatProvider Provider = null
)
Public Sub New (
	FullFileName As String,
	Optional Provider As IFormatProvider = Nothing
)
Parameters
FullFileName
Type: System.String
The filter's full file name to load.
Provider (Optional)
Type: System.IFormatProvider
An object that supports the IFormatProvider interface to correctly parse numbers and dates according to the current culture information. If not provided, the current CultureInfo is used.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a null FullFileName is specified.
See Also
Reference
Filter Class
Filter Overload
Tekla.Structures.Filtering Namespace